tap "antoniorodr/memo"
tap "heroku/brew"
tap "homebrew/services"
tap "microsoft/git"
tap "microsoft/mssql-release"
tap "steipete/tap"
tap "stripe/stripe-cli"
tap "xdevplatform/tap"
tap "yakitrak/yakitrak"
brew "act"
brew "libtiff"
brew "little-cms2"
brew "jpeg-xl"
brew "aom"
brew "apr-util"
brew "awscli"
brew "azure-cli"
brew "biome"
brew "caddy"
brew "node@22", link: true
brew "code-server", restart_service: :changed
brew "coreutils"
brew "libssh2"
brew "curl"
brew "docutils"
brew "dotnet@8"
brew "dprint"
brew "exiftool"
brew "sdl2"
brew "ffmpeg"
brew "fizz"
brew "unixodbc"
brew "freetds"
brew "fzf"
brew "libavif"
brew "webp"
brew "gd"
brew "gemini-cli"
brew "gh"
brew "tesseract"
brew "ghostscript"
brew "gifsicle"
brew "git-filter-repo"
brew "git-lfs"
brew "go"
brew "handbrake"
brew "himalaya"
brew "httpie"
brew "imagemagick"
brew "jpegoptim"
brew "krb5"
brew "libpq"
brew "libzip"
brew "mailhog"
brew "mas"
brew "usage"
brew "mise"
brew "mkcert"
brew "neovim"
brew "net-snmp"
brew "nvm"
brew "oniguruma"
brew "openai-whisper"
brew "ripgrep"
brew "opencode"
brew "openjdk"
brew "openjdk@11"
brew "openjdk@17"
brew "openldap"
brew "openssl@1.1"
brew "optipng"
brew "perl"
brew "pngquant"
brew "pnpm"
brew "pscale"
brew "pyenv"
brew "pyenv-virtualenv"
brew "python@3.11"
brew "rtmpdump"
brew "sqldiff"
brew "stripe-mock"
brew "supabase"
brew "svgo"
brew "tidy-html5"
brew "tmux"
brew "tree"
brew "turso"
brew "uv"
brew "wget"
brew "youtube-dl"
brew "antoniorodr/memo/memo"
brew "heroku/brew/heroku"
brew "microsoft/mssql-release/msodbcsql18"
brew "microsoft/mssql-release/mssql-tools18"
brew "steipete/tap/gifgrep"
brew "steipete/tap/gogcli"
brew "steipete/tap/goplaces"
brew "steipete/tap/imsg"
brew "steipete/tap/peekaboo"
brew "steipete/tap/remindctl"
brew "steipete/tap/sag"
brew "steipete/tap/songsee"
brew "steipete/tap/spogo"
brew "steipete/tap/summarize"
brew "steipete/tap/wacli"
brew "stripe/stripe-cli/stripe"
brew "yakitrak/yakitrak/obsidian-cli"
cask "1password-cli"
cask "codex"
cask "steipete/tap/codexbar"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-lato"
cask "font-open-sans"
cask "font-roboto"
cask "font-source-code-pro"
cask "marta"
cask "proxyman"
cask "switchresx"
cask "xdevplatform/tap/xurl"
mas "1Password for Safari", id: 1569813296
mas "Azure VPN Client", id: 1553936137
mas "Brother P-touch Editor", id: 1453365242
mas "Copilot", id: 1447330651
mas "Developer", id: 640199958
mas "DuckDuckGo Privacy for Safari", id: 1482920575
mas "Final Cut Pro", id: 424389933
mas "Flycut", id: 442160987
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Microsoft Excel", id: 462058435
mas "Microsoft OneNote", id: 784801555
mas "Microsoft Outlook", id: 985367838
mas "Microsoft Word", id: 462054704
mas "Moom Classic", id: 419330170
mas "Numbers", id: 409203825
mas "Numbers", id: 361304891
mas "OneDrive", id: 823766827
mas "Pages", id: 361309726
mas "Pages", id: 409201541
mas "Paste", id: 967805235
mas "Perplexity", id: 6714467650
mas "TickTick", id: 966085870
mas "Velja", id: 1607635845
vscode "aaron-bond.better-comments"
vscode "amodio.tsl-problem-matcher"
vscode "antfu.browse-lite"
vscode "antfu.file-nesting"
vscode "antfu.goto-alias"
vscode "antfu.iconify"
vscode "antfu.icons-carbon"
vscode "antfu.open-in-github-button"
vscode "antfu.slidev"
vscode "antfu.smart-clicks"
vscode "antfu.theme-vitesse"
vscode "antfu.unocss"
vscode "antfu.vite"
vscode "antfu.where-am-i"
vscode "anthropic.claude-code"
vscode "astro-build.astro-vscode"
vscode "bierner.github-markdown-preview"
vscode "bierner.markdown-checkbox"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-footnotes"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bierner.markdown-yaml-preamble"
vscode "bmewburn.vscode-intelephense-client"
vscode "bradlc.vscode-tailwindcss"
vscode "coachrichbart.better-jest"
vscode "cpylua.language-postcss"
vscode "csstools.postcss"
vscode "dakshmiglani.hex-to-rgba"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "denoland.vscode-deno"
vscode "donjayamanne.githistory"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "fabiospampinato.vscode-open-in-github"
vscode "figma.figma-vscode-extension"
vscode "file-icons.file-icons"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "gruntfuggly.todo-tree"
vscode "hollowtree.vue-snippets"
vscode "humao.rest-client"
vscode "johnpapa.vscode-peacock"
vscode "johnsoncodehk.vscode-tsconfig-helper"
vscode "lokalise.i18n-ally"
vscode "mattpocock.ts-error-translator"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "mikestead.dotenv"
vscode "mpontus.tab-cycle"
vscode "mrmlnc.vscode-duplicate"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-playwright.playwright"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "naumovs.color-highlight"
vscode "nuxt.mdc"
vscode "oderwat.indent-rainbow"
vscode "openai.chatgpt"
vscode "pflannery.vscode-versionlens"
vscode "phoenisx.cssvar"
vscode "pkief.material-icon-theme"
vscode "prisma.prisma"
vscode "randomfractalsinc.vscode-data-table"
vscode "rebornix.toggle"
vscode "richie5um2.vscode-sort-json"
vscode "ritwickdey.liveserver"
vscode "sainnhe.gruvbox-material"
vscode "shopify.ruby-lsp"
vscode "sleistner.vscode-fileutils"
vscode "stateful.runme"
vscode "streetsidesoftware.code-spell-checker"
vscode "stripe.vscode-stripe"
vscode "svelte.svelte-vscode"
vscode "tamasfe.even-better-toml"
vscode "tombonnike.vscode-status-bar-format-toggle"
vscode "unifiedjs.vscode-mdx"
vscode "unional.vscode-sort-package-json"
vscode "usernamehw.errorlens"
vscode "voorjaar.windicss-intellisense"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "vue.volar"
vscode "wakatime.vscode-wakatime"
vscode "wesbos.theme-cobalt2"
vscode "wmaurer.change-case"
vscode "yinkai15.aemsync"
vscode "yoavbls.pretty-ts-errors"
vscode "yzhang.markdown-all-in-one"
vscode "znck.grammarly"
uv "nano-pdf"
uv "powerline-status"
