tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"

###############
# CORE SYSTEM #
###############
brew "git"
brew "gh"
brew "openssl"
brew "wget"
brew "curl"
brew "jq"
brew "yq"
brew "tree"
brew "fzf"
brew "ripgrep"
brew "fd"
brew "bat"
brew "htop"
brew "tmux"

#####################
# SHELL + TERMINAL  #
#####################
brew "zsh"
brew "starship"
brew "zoxide"
brew "thefuck"
brew "eza"

cask "ghostty"
cask "font-jetbrains-mono-nerd-font"

################
# DEV TOOLING  #
################
brew "node"
brew "pnpm"
brew "nvm"
brew "deno"

brew "dotnet"
brew "python"

brew "docker"
cask "docker"

###################
# PRODUCTIVITY    #
###################
cask "raycast"
cask "rectangle"
cask "1password"
cask "tailscale"
cask "obsidian"

###################
# DESIGN / ASSETS #
###################
cask "figma"
cask "imageoptim"

###################
# BROWSERS        #
###################
cask "google-chrome"
cask "firefox"
cask "arc"

###################
# UTILITIES       #
###################
cask "appcleaner"
cask "keepingyouawake"
cask "stats"

###################
# OPTIONAL EXTRAS #
###################
# brew "mise"
# brew "awscli"
# brew "azure-cli"
# brew "google-cloud-sdk"
